TexasInstruments/c2000ware-core-sdk/driverlib/f28p551x/driverlib/xbar.h
#ifndef DOXYGEN_PDF_IGNORE
//*****************************************************************************
//
//! The following values define the \e muxConfig parameter for
//! XBAR_setOutputMuxConfig().
//
//*****************************************************************************
typedef enum
{

	//
	//OUTPUTXBAR
	//
	XBAR_OUT_MUX00_CMPSS1_CTRIPOUTH		 = 0x0000,	//!CMPSS1 CTRIPOUTH
	XBAR_OUT_MUX00_CMPSS1_CTRIPOUTH_OR_L		 = 0x0001,	//!CMPSS1 CTRIPOUTH OR CTRIPOUTL
	XBAR_OUT_MUX00_ADCAEVT1		 = 0x0002,	//!ADCAEVT1
	XBAR_OUT_MUX00_ECAP1_OUT		 = 0x0003,	//!ECAP1 OUT
	XBAR_OUT_MUX01_CMPSS1_CTRIPOUTL		 = 0x0200,	//!CMPSS1 CTRIPOUTL
	XBAR_OUT_MUX01_INPUTXBAR1		 = 0x0201,	//!INPUTXBAR INPUT1
	XBAR_OUT_MUX01_CLB1_OUT4		 = 0x0202,	//!CLB1 OUT4
	XBAR_OUT_MUX01_ADCCEVT1		 = 0x0203,	//!ADCCEVT1
	XBAR_OUT_MUX02_CMPSS2_CTRIPOUTH		 = 0x0400,	//!CMPSS2 CTRIPOUTH
	XBAR_OUT_MUX02_CMPSS2_CTRIPOUTH_OR_L		 = 0x0401,	//!CMPSS2 CTRIPOUTH OR CTRIPOUTL
	XBAR_OUT_MUX02_ADCAEVT2		 = 0x0402,	//!ADCAEVT2
	XBAR_OUT_MUX02_ECAP2_OUT		 = 0x0403,	//!ECAP2 OUT
	XBAR_OUT_MUX03_CMPSS2_CTRIPOUTL		 = 0x0600,	//!CMPSS2 CTRIPOUTL
	XBAR_OUT_MUX03_INPUTXBAR2		 = 0x0601,	//!INPUTXBAR INPUT2
	XBAR_OUT_MUX03_CLB1_OUT5		 = 0x0602,	//!CLB1 OUT5
	XBAR_OUT_MUX03_ADCCEVT2		 = 0x0603,	//!ADCCEVT2
	XBAR_OUT_MUX04_CMPSS3_CTRIPOUTH		 = 0x0800,	//!CMPSS3 CTRIPOUTH
	XBAR_OUT_MUX04_CMPSS3_CTRIPOUTH_OR_L		 = 0x0801,	//!CMPSS3 CTRIPOUTH OR CTRIPOUTL
	XBAR_OUT_MUX04_ADCAEVT3		 = 0x0802,	//!ADCAEVT3
	XBAR_OUT_MUX05_CMPSS3_CTRIPOUTL		 = 0x0A00,	//!CMPSS3 CTRIPOUTL
	XBAR_OUT_MUX05_INPUTXBAR3		 = 0x0A01,	//!INPUTXBAR INPUT3
	XBAR_OUT_MUX05_CLB2_OUT4		 = 0x0A02,	//!CLB2 OUT4
	XBAR_OUT_MUX05_ADCCEVT3		 = 0x0A03,	//!ADCCEVT3
	XBAR_OUT_MUX06_CMPSS4_CTRIPOUTH		 = 0x0C00,	//!CMPSS4 CTRIPOUTH
	XBAR_OUT_MUX06_CMPSS4_CTRIPOUTH_OR_L		 = 0x0C01,	//!CMPSS4 CTRIPOUTH OR CTRIPOUTL
	XBAR_OUT_MUX06_ADCAEVT4		 = 0x0C02,	//!ADCAEVT4
	XBAR_OUT_MUX07_CMPSS4_CTRIPOUTL		 = 0x0E00,	//!CMPSS4 CTRIPOUTL
	XBAR_OUT_MUX07_INPUTXBAR4		 = 0x0E01,	//!INPUTXBAR INPUT4
	XBAR_OUT_MUX07_CLB2_OUT5		 = 0x0E02,	//!CLB2 OUT5
	XBAR_OUT_MUX07_ADCCEVT4		 = 0x0E03,	//!ADCCEVT4
	XBAR_OUT_MUX08_ADCBEVT1		 = 0x1002,	//!ADCBEVT1
	XBAR_OUT_MUX09_INPUTXBAR5		 = 0x1201,	//!INPUTXBAR INPUT5
	XBAR_OUT_MUX09_CLB3_OUT4		 = 0x1202,	//!CLB3 OUT4
	XBAR_OUT_MUX09_ADCDEVT1		 = 0x1203,	//!ADCDEVT1
	XBAR_OUT_MUX10_ADCBEVT2		 = 0x1402,	//!ADCBEVT2
	XBAR_OUT_MUX11_INPUTXBAR6		 = 0x1601,	//!INPUTXBAR INPUT6
	XBAR_OUT_MUX11_CLB3_OUT5		 = 0x1602,	//!CLB3 OUT5
	XBAR_OUT_MUX11_ADCDEVT2		 = 0x1603,	//!ADCDEVT2
	XBAR_OUT_MUX12_ADCBEVT3		 = 0x1802,	//!ADCBEVT3
	XBAR_OUT_MUX13_ADCSOCA		 = 0x1A01,	//!ADCSOCA
	XBAR_OUT_MUX13_CLB4_OUT4		 = 0x1A02,	//!CLB4 OUT4
	XBAR_OUT_MUX13_ADCDEVT3		 = 0x1A03,	//!ADCDEVT3
	XBAR_OUT_MUX14_ADCBEVT4		 = 0x1C02,	//!ADCBEVT4
	XBAR_OUT_MUX14_EXTSYNCOUT		 = 0x1C03,	//!EXTSYNCOUT
	XBAR_OUT_MUX15_ADCSOCB		 = 0x1E01,	//!ADCSOCB
	XBAR_OUT_MUX15_CLB4_OUT5		 = 0x1E02,	//!CLB4 OUT5
	XBAR_OUT_MUX15_ADCDEVT4		 = 0x1E03,	//!ADCDEVT4
	XBAR_OUT_MUX16_SD1FLT1_COMPH = 0x2000,  //SD1FLT1_COMPH
	XBAR_OUT_MUX16_SD1FLT1_COMPH_OR_COMPL = 0x2001,  //SD1FLT1_COMPH_OR_COMPL
	XBAR_OUT_MUX16_ADCEEVT1		 = 0x2002,	//!ADCEEVT1
	XBAR_OUT_MUX17_SD1FLT1_COMPL = 0x2200,  //SD1FLT1_COMPL
	XBAR_OUT_MUX17_CLAHALT		 = 0x2203,	//!CLAHALT
	XBAR_OUT_MUX18_SD1FLT2_COMPH = 0x2400,  //SD1FLT2_COMPH
	XBAR_OUT_MUX18_SD1FLT2_COMPH_OR_COMPL = 0x2401,  //SD1FLT2_COMPH_OR_COMPL
	XBAR_OUT_MUX18_ADCEEVT2		 = 0x2402,	//!ADCEEVT2
	XBAR_OUT_MUX19_SD1FLT2_COMPL = 0x2600,  //SD1FLT2_COMPL
	XBAR_OUT_MUX19_ERRORSTS		 = 0x2603,	//!ERRORSTS
	XBAR_OUT_MUX20_SD1FLT3_COMPH = 0x2800,  //SD1FLT3_COMPH
	XBAR_OUT_MUX20_SD1FLT3_COMPH_OR_COMPL = 0x2801,  //SD1FLT3_COMPH_OR_COMPL
	XBAR_OUT_MUX20_ADCEEVT3		 = 0x2802,	//!ADCEEVT3
	XBAR_OUT_MUX21_SD1FLT3_COMPL = 0x2A00,  //SD1FLT3_COMPL
	XBAR_OUT_MUX21_SD2FLT1_COMPH_OR_COMPL = 0x2A01,  //SD2FLT1_COMPH_OR_COMPL
	XBAR_OUT_MUX21_FSIA_RX_TRIG2		 = 0x2A03,	//!FSIA RX TRIG2
	XBAR_OUT_MUX22_SD1FLT4_COMPH = 0x2C00,  //SD1FLT4_COMPH
	XBAR_OUT_MUX22_SD1FLT4_COMPH_OR_COMPL = 0x2C01,  //SD1FLT4_COMPH_OR_COMPL
	XBAR_OUT_MUX22_ADCEEVT4		 = 0x2C02,	//!ADCEEVT4
	XBAR_OUT_MUX23_SD1FLT4_COMPL = 0x2E00,  //SD1FLT4_COMPL
	XBAR_OUT_MUX23_ADCA_EXTMUXSEL0		 = 0x2E01,	//!ADCA EXTMUXSEL0
	XBAR_OUT_MUX23_ADCC_EXTMUXSEL0		 = 0x2E02,	//!ADCC EXTMUXSEL0
	XBAR_OUT_MUX23_ADCE_EXTMUXSEL0		 = 0x2E03,	//!ADCE EXTMUXSEL0
	XBAR_OUT_MUX24_SD2FLT1_COMPH = 0x3000,  //SD2FLT1_COMPH
	XBAR_OUT_MUX24_ADCA_EXTMUXSEL1		 = 0x3001,	//!ADCA EXTMUXSEL1
	XBAR_OUT_MUX24_ADCC_EXTMUXSEL1		 = 0x3002,	//!ADCC EXTMUXSEL1
	XBAR_OUT_MUX24_ADCE_EXTMUXSEL1		 = 0x3003,	//!ADCE EXTMUXSEL1
	XBAR_OUT_MUX25_SD2FLT1_COMPL = 0x3200,  //SD2FLT1_COMPL
	XBAR_OUT_MUX25_ADCA_EXTMUXSEL2		 = 0x3201,	//!ADCA EXTMUXSEL2
	XBAR_OUT_MUX25_ADCC_EXTMUXSEL2		 = 0x3202,	//!ADCC EXTMUXSEL2
	XBAR_OUT_MUX25_ADCE_EXTMUXSEL2		 = 0x3203,	//!ADCE EXTMUXSEL2
	XBAR_OUT_MUX26_SD2FLT2_COMPH = 0x3400,  //SD2FLT2_COMPH
	XBAR_OUT_MUX26_ADCA_EXTMUXSEL3		 = 0x3401,	//!ADCA EXTMUXSEL3
	XBAR_OUT_MUX26_ADCC_EXTMUXSEL3		 = 0x3402,	//!ADCC EXTMUXSEL3
	XBAR_OUT_MUX26_ADCE_EXTMUXSEL3		 = 0x3403,	//!ADCE EXTMUXSEL3
	XBAR_OUT_MUX27_SD2FLT2_COMPL = 0x3600,  //SD2FLT2_COMPL
	XBAR_OUT_MUX27_ADCB_EXTMUXSEL0		 = 0x3601,	//!ADCB EXTMUXSEL0
	XBAR_OUT_MUX27_ADCD_EXTMUXSEL0		 = 0x3602,	//!ADCD EXTMUXSEL0
	XBAR_OUT_MUX27_SD2FLT2_COMPH_OR_COMPL = 0x3603,  //SD2FLT2_COMPH_OR_COMPL
	XBAR_OUT_MUX28_SD2FLT3_COMPH = 0x3800,  //SD2FLT3_COMPH
	XBAR_OUT_MUX28_ADCB_EXTMUXSEL1		 = 0x3801,	//!ADCB EXTMUXSEL1
	XBAR_OUT_MUX28_ADCD_EXTMUXSEL1		 = 0x3802,	//!ADCD EXTMUXSEL1
	XBAR_OUT_MUX28_SD2FLT3_COMPH_OR_COMPL = 0x3803,  //SD2FLT3_COMPH_OR_COMPL
	XBAR_OUT_MUX29_SD2FLT3_COMPL = 0x3A00,  //SD2FLT3_COMPL
	XBAR_OUT_MUX29_ADCB_EXTMUXSEL2		 = 0x3A01,	//!ADCB EXTMUXSEL2
	XBAR_OUT_MUX29_ADCD_EXTMUXSEL2		 = 0x3A02,	//!ADCD EXTMUXSEL2
	XBAR_OUT_MUX30_SD2FLT4_COMPH = 0x3C00,  //SD2FLT4_COMPH
	XBAR_OUT_MUX30_ADCB_EXTMUXSEL3		 = 0x3C01,	//!ADCB EXTMUXSEL3
	XBAR_OUT_MUX30_ADCD_EXTMUXSEL3		 = 0x3C02,	//!ADCD EXTMUXSEL3
	XBAR_OUT_MUX30_EPG1_OUT0		 = 0x3C03,	//!EPG1OUT0
	XBAR_OUT_MUX31_SD2FLT4_COMPL = 0x3E00,  //SD2FLT4_COMPL
	XBAR_OUT_MUX31_SD2FLT4_COMPH_OR_COMPL = 0x3E01,  //SD2FLT4_COMPH_OR_COMPL
	XBAR_OUT_MUX31_ERRORSTS		 = 0x3E02,	//!ERRORSTS
	XBAR_OUT_MUX31_EPG1_OUT1		 = 0x3E03,	//!EPG1 OUT1

	//
	//CLBOUTPUTXBAR
	//
	XBAR_OUT_MUX00_CLB1_OUT0		 = 0x0000,	//!CLB1 OUT0
	XBAR_OUT_MUX00_XTRIP_OUT1		 = 0x0003,	//!OUTPUTXBAR1
	XBAR_OUT_MUX01_CLB1_OUT1		 = 0x0200,	//!CLB1 OUT1
	XBAR_OUT_MUX01_XTRIP_OUT2		 = 0x0203,	//!OUTPUTXBAR2
	XBAR_OUT_MUX02_CLB1_OUT2		 = 0x0400,	//!CLB1 OUT2
	XBAR_OUT_MUX03_CLB1_OUT3		 = 0x0600,	//!CLB1 OUT3
	XBAR_OUT_MUX04_CLB1_OUT4		 = 0x0800,	//!CLB1 OUT4
	XBAR_OUT_MUX05_CLB1_OUT5		 = 0x0A00,	//!CLB1 OUT5
	XBAR_OUT_MUX06_CLB1_OUT6		 = 0x0C00,	//!CLB1 OUT6
	XBAR_OUT_MUX07_CLB1_OUT7		 = 0x0E00,	//!CLB1 OUT7
	XBAR_OUT_MUX08_CLB2_OUT0		 = 0x1000,	//!CLB2 OUT0
	XBAR_OUT_MUX08_XTRIP_OUT3		 = 0x1003,	//!OUTPUTXBAR3
	XBAR_OUT_MUX09_CLB2_OUT1		 = 0x1200,	//!CLB2 OUT1
	XBAR_OUT_MUX09_XTRIP_OUT4		 = 0x1203,	//!OUTPUTXBAR4
	XBAR_OUT_MUX10_CLB2_OUT2		 = 0x1400,	//!CLB2 OUT2
	XBAR_OUT_MUX11_CLB2_OUT3		 = 0x1600,	//!CLB2 OUT3
	XBAR_OUT_MUX12_CLB2_OUT4		 = 0x1800,	//!CLB2 OUT4
	XBAR_OUT_MUX13_CLB2_OUT5		 = 0x1A00,	//!CLB2 OUT5
	XBAR_OUT_MUX14_CLB2_OUT6		 = 0x1C00,	//!CLB2 OUT6
	XBAR_OUT_MUX15_CLB2_OUT7		 = 0x1E00,	//!CLB2 OUT7
	XBAR_OUT_MUX16_CLB3_OUT0 = 0x2000,  //CLB3_OUT0
	XBAR_OUT_MUX16_XTRIP_OUT5		 = 0x2003,	//!OUTPUTXBAR5
	XBAR_OUT_MUX17_CLB3_OUT1 = 0x2200,  //CLB3_OUT1
	XBAR_OUT_MUX17_XTRIP_OUT6		 = 0x2203,	//!OUTPUTXBAR6
	XBAR_OUT_MUX18_CLB3_OUT2 = 0x2400,  //CLB3_OUT2
	XBAR_OUT_MUX19_CLB3_OUT3 = 0x2600,  //CLB3_OUT3
	XBAR_OUT_MUX20_CLB3_OUT4 = 0x2800,  //CLB3_OUT4
	XBAR_OUT_MUX21_CLB3_OUT5 = 0x2A00,  //CLB3_OUT5
	XBAR_OUT_MUX22_CLB3_OUT6 = 0x2C00,  //CLB3_OUT6
	XBAR_OUT_MUX23_CLB3_OUT7 = 0x2E00,  //CLB3_OUT7
	XBAR_OUT_MUX24_CLB4_OUT0 = 0x3000,  //CLB4_OUT0
	XBAR_OUT_MUX24_XTRIP_OUT7		 = 0x3003,	//!OUTPUTXBAR7
	XBAR_OUT_MUX25_CLB4_OUT1 = 0x3200,  //CLB4_OUT1
	XBAR_OUT_MUX25_XTRIP_OUT8		 = 0x3203,	//!OUTPUTXBAR8
	XBAR_OUT_MUX26_CLB4_OUT2 = 0x3400,  //CLB4_OUT2
	XBAR_OUT_MUX27_CLB4_OUT3 = 0x3600,  //CLB4_OUT3
	XBAR_OUT_MUX28_CLB4_OUT4 = 0x3800,  //CLB4_OUT4
	XBAR_OUT_MUX29_CLB4_OUT5 = 0x3A00,  //CLB4_OUT5
	XBAR_OUT_MUX30_CLB4_OUT6 = 0x3C00,  //CLB4_OUT6
	XBAR_OUT_MUX30_EPG1_OUT2		 = 0x3C03,	//!EPG1 OUT2
	XBAR_OUT_MUX31_CLB4_OUT7 = 0x3E00,  //CLB4_OUT7
	XBAR_OUT_MUX31_EPG1_OUT3		 = 0x3E03	//!EPG1 OUT3
} XBAR_OutputMuxConfig;


//*****************************************************************************
//
//! The following values define the \e muxConfig parameter for
//! XBAR_setEPWMMuxConfig().
//
//*****************************************************************************
typedef enum
{
	XBAR_EPWM_MUX00_CMPSS1_CTRIPH		 = 0x0000,	//!CMPSS1 CTRIPH
	XBAR_EPWM_MUX00_CMPSS1_CTRIPH_OR_L		 = 0x0001,	//!CMPSS1 CTRIPH OR L
	XBAR_EPWM_MUX00_ADCAEVT1		 = 0x0002,	//!ADCAEVT1
	XBAR_EPWM_MUX00_ECAP1_OUT		 = 0x0003,	//!ECAP1 OUT
	XBAR_EPWM_MUX01_CMPSS1_CTRIPL		 = 0x0200,	//!CMPSS1 CTRIPL
	XBAR_EPWM_MUX01_INPUTXBAR1_INPUT1		 = 0x0201,	//!INPUTXBAR INPUT1
	XBAR_EPWM_MUX01_CLB1_OUT4		 = 0x0202,	//!CLB1 OUT4
	XBAR_EPWM_MUX01_ADCCEVT1		 = 0x0203,	//!ADCCEVT1
	XBAR_EPWM_MUX02_CMPSS2_CTRIPH		 = 0x0400,	//!CMPSS2 CTRIPH
	XBAR_EPWM_MUX02_CMPSS2_CTRIPH_OR_L		 = 0x0401,	//!CMPSS2 CTRIPH OR L
	XBAR_EPWM_MUX02_ADCAEVT2		 = 0x0402,	//!ADCAEVT2
	XBAR_EPWM_MUX02_ECAP2_OUT		 = 0x0403,	//!ECAP2 OUT
	XBAR_EPWM_MUX03_CMPSS2_CTRIPL		 = 0x0600,	//!CMPSS2 CTRIPL
	XBAR_EPWM_MUX03_INPUTXBAR1_INPUT2		 = 0x0601,	//!INPUTXBAR INPUT2
	XBAR_EPWM_MUX03_CLB1_OUT5		 = 0x0602,	//!CLB1 OUT5
	XBAR_EPWM_MUX03_ADCCEVT2		 = 0x0603,	//!ADCCEVT2
	XBAR_EPWM_MUX04_CMPSS3_CTRIPH		 = 0x0800,	//!CMPSS3 CTRIPH
	XBAR_EPWM_MUX04_CMPSS3_CTRIPH_OR_L		 = 0x0801,	//!CMPSS3 CTRIPH OR L
	XBAR_EPWM_MUX04_ADCAEVT3		 = 0x0802,	//!ADCAEVT3
	XBAR_EPWM_MUX05_CMPSS3_CTRIPL		 = 0x0A00,	//!CMPSS3 CTRIPL
	XBAR_EPWM_MUX05_INPUTXBAR1_INPUT3		 = 0x0A01,	//!INPUTXBAR INPUT3
	XBAR_EPWM_MUX05_CLB2_OUT4		 = 0x0A02,	//!CLB2 OUT4
	XBAR_EPWM_MUX05_ADCCEVT3		 = 0x0A03,	//!ADCCEVT3
	XBAR_EPWM_MUX06_CMPSS4_CTRIPH		 = 0x0C00,	//!CMPSS4 CTRIPH
	XBAR_EPWM_MUX06_CMPSS4_CTRIPH_OR_L		 = 0x0C01,	//!CMPSS4 CTRIPH OR L
	XBAR_EPWM_MUX06_ADCAEVT4		 = 0x0C02,	//!ADCAEVT4
	XBAR_EPWM_MUX07_CMPSS4_CTRIPL		 = 0x0E00,	//!CMPSS4 CTRIPL
	XBAR_EPWM_MUX07_INPUTXBAR1_INPUT4		 = 0x0E01,	//!INPUTXBAR INPUT4
	XBAR_EPWM_MUX07_CLB2_OUT5		 = 0x0E02,	//!CLB2 OUT5
	XBAR_EPWM_MUX07_ADCCEVT4		 = 0x0E03,	//!ADCCEVT4
	XBAR_EPWM_MUX08_ADCBEVT1		 = 0x1002,	//!ADCBEVT1
	XBAR_EPWM_MUX09_INPUTXBAR1_INPUT5		 = 0x1201,	//!INPUTXBAR INPUT5
	XBAR_EPWM_MUX09_CLB3_OUT4 = 0x1202,  //CLB3_OUT4
	XBAR_EPWM_MUX09_ADCDEVT1		 = 0x1203,	//!ADCDEVT1
	XBAR_EPWM_MUX10_ADCBEVT2		 = 0x1402,	//!ADCBEVT2
	XBAR_EPWM_MUX11_INPUTXBAR1_INPUT6		 = 0x1601,	//!INPUTXBAR INPUT6
	XBAR_EPWM_MUX11_CLB3_OUT5 = 0x1602,  //CLB3_OUT5
	XBAR_EPWM_MUX11_ADCDEVT2		 = 0x1603,	//!ADCDEVT2
	XBAR_EPWM_MUX12_ADCBEVT3		 = 0x1802,	//!ADCBEVT3
	XBAR_EPWM_MUX13_ADCSOCA		 = 0x1A01,	//!ADCSOCA
	XBAR_EPWM_MUX13_CLB4_OUT4 = 0x1A02,  //CLB4_OUT4
	XBAR_EPWM_MUX13_ADCDEVT3		 = 0x1A03,	//!ADCDEVT3
	XBAR_EPWM_MUX14_ADCBEVT4		 = 0x1C02,	//!ADCBEVT4
	XBAR_EPWM_MUX14_EXTSYNCOUT		 = 0x1C03,	//!EXTSYNCOUT
	XBAR_EPWM_MUX15_ADCSOCB		 = 0x1E01,	//!ADCSOCB
	XBAR_EPWM_MUX15_CLB4_OUT5 = 0x1E02,  //CLB4_OUT5
	XBAR_EPWM_MUX15_ADCDEVT4		 = 0x1E03,	//!ADCDEVT4
	XBAR_EPWM_MUX16_SD1FLT1_COMPH = 0x2000,  //SD1FLT1_COMPH
	XBAR_EPWM_MUX16_SD1FLT1_COMPH_OR_COMPL = 0x2001,  //SD1FLT1_COMPH_OR_COMPL
	XBAR_EPWM_MUX16_ADCEEVT1		 = 0x2002,	//!ADCEEVT1
	XBAR_EPWM_MUX17_SD1FLT1_COMPL = 0x2200,  //SD1FLT1_COMPL
	XBAR_EPWM_MUX17_INPUTXBAR1_INPUT7		 = 0x2201,	//!INPUTXBAR INPUT7
	XBAR_EPWM_MUX17_CLBINPUTXBAR7		 = 0x2202,	//!CLBINPUTXBAR7
	XBAR_EPWM_MUX17_CLAHALT		 = 0x2203,	//!CLAHALT
	XBAR_EPWM_MUX18_SD1FLT2_COMPH = 0x2400,  //SD1FLT2_COMPH
	XBAR_EPWM_MUX18_SD1FLT2_COMPH_OR_COMPL = 0x2401,  //SD1FLT2_COMPH_OR_COMPL
	XBAR_EPWM_MUX18_ADCEEVT2		 = 0x2402,	//!ADCEEVT2
	XBAR_EPWM_MUX19_SD1FLT2_COMPL = 0x2600,  //SD1FLT2_COMPL
	XBAR_EPWM_MUX19_INPUTXBAR1_INPUT8		 = 0x2601,	//!INPUTXBAR INPUT8
	XBAR_EPWM_MUX19_CLBINPUTXBAR8		 = 0x2602,	//!CLBINPUTXBAR8
	XBAR_EPWM_MUX19_ERRORSTS		 = 0x2603,	//!ERRORSTS
	XBAR_EPWM_MUX20_SD1FLT3_COMPH = 0x2800,  //SD1FLT3_COMPH
	XBAR_EPWM_MUX20_SD1FLT3_COMPH_OR_COMPL = 0x2801,  //SD1FLT3_COMPH_OR_COMPL
	XBAR_EPWM_MUX20_ADCEEVT3		 = 0x2802,	//!ADCEEVT3
	XBAR_EPWM_MUX20_FSIA_RX_TRIG1		 = 0x2803,	//!FSIA RX TRIG1
	XBAR_EPWM_MUX21_SD1FLT3_COMPL = 0x2A00,  //SD1FLT3_COMPL
	XBAR_EPWM_MUX21_INPUTXBAR1_INPUT9		 = 0x2A01,	//!INPUTXBAR INPUT9
	XBAR_EPWM_MUX21_CLBINPUTXBAR9		 = 0x2A02,	//!CLBINPUTXBAR9
	XBAR_EPWM_MUX22_ADCEEVT4		 = 0x2C02,	//!ADCEEVT4
	XBAR_EPWM_MUX22_SD1FLT4_COMPH = 0x2C00,  //SD1FLT4_COMPH
	XBAR_EPWM_MUX22_SD1FLT4_COMPH_OR_COMPL = 0x2C01,  //SD1FLT4_COMPH_OR_COMPL
	XBAR_EPWM_MUX23_SD1FLT4_COMPL = 0x2E00,  //SD1FLT4_COMPL
	XBAR_EPWM_MUX23_INPUTXBAR1_INPUT10		 = 0x2E01,	//!INPUTXBAR INPUT10
	XBAR_EPWM_MUX23_CLBINPUTXBAR10		 = 0x2E02,	//!CLBINPUTXBAR10
	XBAR_EPWM_MUX24_SD2FLT1_COMPH = 0x3000,  //SD2FLT1_COMPH
	XBAR_EPWM_MUX24_SD2FLT1_COMPH_OR_COMPL = 0x3001,  //SD2FLT1_COMPH_OR_COMPL
	XBAR_EPWM_MUX25_SD2FLT1_COMPL = 0x3200,  //SD2FLT1_COMPL
	XBAR_EPWM_MUX25_INPUTXBAR1_INPUT11		 = 0x3201,	//!INPUTXBAR INPUT11
	XBAR_EPWM_MUX25_MCANA_FEVT0		 = 0x3202,	//!MCANA FEVT0
	XBAR_EPWM_MUX25_CLBINPUTXBAR11		 = 0x3203,	//!CLBINPUTXBAR11
	XBAR_EPWM_MUX26_SD2FLT2_COMPH = 0x3400,  //SD2FLT2_COMPH
	XBAR_EPWM_MUX26_SD2FLT2_COMPH_OR_COMPL = 0x3401,  //SD2FLT2_COMPH_OR_COMPL
	XBAR_EPWM_MUX27_SD2FLT2_COMPL = 0x3600,  //SD2FLT2_COMPL
	XBAR_EPWM_MUX27_INPUTXBAR1_INPUT12		 = 0x3601,	//!INPUTXBAR INPUT12
	XBAR_EPWM_MUX27_MCANA_FEVT1		 = 0x3602,	//!MCANA FEVT1
	XBAR_EPWM_MUX27_CLBINPUTXBAR12		 = 0x3603,	//!CLBINPUTXBAR12
	XBAR_EPWM_MUX28_SD2FLT3_COMPH = 0x3800,  //SD2FLT3_COMPH
	XBAR_EPWM_MUX28_SD2FLT3_COMPH_OR_COMPL = 0x3801,  //SD2FLT3_COMPH_OR_COMPL
	XBAR_EPWM_MUX29_SD2FLT3_COMPL = 0x3A00,  //SD2FLT3_COMPL
	XBAR_EPWM_MUX29_INPUTXBAR1_INPUT13		 = 0x3A01,	//!INPUTXBAR INPUT13
	XBAR_EPWM_MUX29_MCANA_FEVT2		 = 0x3A02,	//!MCANA FEVT2
	XBAR_EPWM_MUX29_CLBINPUTXBAR13		 = 0x3A03,	//!CLBINPUTXBAR13
	XBAR_EPWM_MUX30_SD2FLT4_COMPH = 0x3C00,  //SD2FLT4_COMPH
	XBAR_EPWM_MUX30_SD2FLT4_COMPH_OR_COMPL = 0x3C01,  //SD2FLT4_COMPH_OR_COMPL
	XBAR_EPWM_MUX31_SD2FLT4_COMPL = 0x3E00,  //SD2FLT4_COMPL
	XBAR_EPWM_MUX31_INPUTXBAR1_INPUT14		 = 0x3E01,	//!INPUTXBAR INPUT14
	XBAR_EPWM_MUX31_ERRORSTS		 = 0x3E02,	//!ERRORSTS
	XBAR_EPWM_MUX31_CLBINPUTXBAR14		 = 0x3E03,	//!CLBINPUTXBAR14
} XBAR_EPWMMuxConfig;


//*****************************************************************************
//
// The following values define the muxConfig parameter for
// XBAR_setCLBMuxConfig().
//
//*****************************************************************************
typedef enum
{
	XBAR_CLB_MUX00_CMPSS1_CTRIPH		 = 0x0000,	//!CMPSS1 CTRIPH
	XBAR_CLB_MUX00_CMPSS1_CTRIPH_OR_L		 = 0x0001,	//!CMPSS1 CTRIPH OR L
	XBAR_CLB_MUX00_ADCAEVT1		 = 0x0002,	//!ADCAEVT1
	XBAR_CLB_MUX00_ECAP1_OUT		 = 0x0003,	//!ECAP1 OUT
	XBAR_CLB_MUX01_CMPSS1_CTRIPL		 = 0x0200,	//!CMPSS1 CTRIPL
	XBAR_CLB_MUX01_INPUTXBAR1_INPUT1		 = 0x0201,	//!INPUTXBAR1 INPUT1
	XBAR_CLB_MUX01_CLB1_OUT4		 = 0x0202,	//!CLB1 OUT4
	XBAR_CLB_MUX01_ADCCEVT1		 = 0x0203,	//!ADCCEVT1
	XBAR_CLB_MUX02_CMPSS2_CTRIPH		 = 0x0400,	//!CMPSS2 CTRIPH
	XBAR_CLB_MUX02_CMPSS2_CTRIPH_OR_L		 = 0x0401,	//!CMPSS2 CTRIPH OR L
	XBAR_CLB_MUX02_ADCAEVT2		 = 0x0402,	//!ADCAEVT2
	XBAR_CLB_MUX02_ECAP2_OUT		 = 0x0403,	//!ECAP2 OUT
	XBAR_CLB_MUX03_CMPSS2_CTRIPL		 = 0x0600,	//!CMPSS2 CTRIPL
	XBAR_CLB_MUX03_INPUTXBAR1_INPUT2		 = 0x0601,	//!INPUTXBAR1 INPUT2
	XBAR_CLB_MUX03_CLB1_OUT5		 = 0x0602,	//!CLB1 OUT5
	XBAR_CLB_MUX03_ADCCEVT2		 = 0x0603,	//!ADCCEVT2
	XBAR_CLB_MUX04_CMPSS3_CTRIPH		 = 0x0800,	//!CMPSS3 CTRIPH
	XBAR_CLB_MUX04_CMPSS3_CTRIPH_OR_L		 = 0x0801,	//!CMPSS3 CTRIPH OR L
	XBAR_CLB_MUX04_ADCAEVT3		 = 0x0802,	//!ADCAEVT3
	XBAR_CLB_MUX04_SD1FLT1_COMPZ		 = 0x0803,	//!SD1FLT1_COMPZ
	XBAR_CLB_MUX05_CMPSS3_CTRIPL		 = 0x0A00,	//!CMPSS3 CTRIPL
	XBAR_CLB_MUX05_INPUTXBAR1_INPUT3		 = 0x0A01,	//!INPUTXBAR INPUT3
	XBAR_CLB_MUX05_CLB2_OUT4		 = 0x0A02,	//!CLB2 OUT4
	XBAR_CLB_MUX05_ADCCEVT3		 = 0x0A03,	//!ADCCEVT3
	XBAR_CLB_MUX06_CMPSS4_CTRIPH		 = 0x0C00,	//!CMPSS4 CTRIPH
	XBAR_CLB_MUX06_CMPSS4_CTRIPH_OR_L		 = 0x0C01,	//!CMPSS4 CTRIPH OR L
	XBAR_CLB_MUX06_ADCAEVT4		 = 0x0C02,	//!ADCAEVT4
	XBAR_CLB_MUX06_SD2FLT1_COMPZ = 0x0C03,  //SD2FLT1_COMPZ
	XBAR_CLB_MUX07_CMPSS4_CTRIPL		 = 0x0E00,	//!CMPSS4 CTRIPL
	XBAR_CLB_MUX07_INPUTXBAR1_INPUT4		 = 0x0E01,	//!INPUTXBAR INPUT4
	XBAR_CLB_MUX07_CLB2_OUT5		 = 0x0E02,	//!CLB2 OUT5
	XBAR_CLB_MUX07_ADCCEVT4		 = 0x0E03,	//!ADCCEVT4
	XBAR_CLB_MUX08_ADCBEVT1		 = 0x1002,	//!ADCBEVT1
	XBAR_CLB_MUX08_SD2FLT2_COMPZ = 0x1003,  //SD2FLT2_COMPZ
	XBAR_CLB_MUX09_INPUTXBAR1_INPUT5		 = 0x1201,	//!INPUTXBAR INPUT5
	XBAR_CLB_MUX09_CLB3_OUT4		 = 0x1202,	//!CLB3 OUT4
	XBAR_CLB_MUX09_ADCDEVT1		 = 0x1203,	//!ADCDEVT1
	XBAR_CLB_MUX10_ADCBEVT2		 = 0x1402,	//!ADCBEVT2
	XBAR_CLB_MUX10_SD2FLT3_COMPZ = 0x1403,  //SD2FLT3_COMPZ
	XBAR_CLB_MUX11_INPUTXBAR1_INPUT6		 = 0x1601,	//!INPUTXBAR INPUT6
	XBAR_CLB_MUX11_CLB3_OUT5		 = 0x1602,	//!CLB3 OUT5
	XBAR_CLB_MUX11_ADCDEVT2		 = 0x1603,	//!ADCDEVT2
	XBAR_CLB_MUX12_ADCBEVT3		 = 0x1802,	//!ADCBEVT3
	XBAR_CLB_MUX12_SD2FLT4_COMPZ = 0x1803,  //SD2FLT4_COMPZ
	XBAR_CLB_MUX13_ADCSOCA		 = 0x1A01,	//!ADCSOCA
	XBAR_CLB_MUX13_CLB4_OUT4		 = 0x1A02,	//!CLB4 OUT4
	XBAR_CLB_MUX13_ADCDEVT3		 = 0x1A03,	//!ADCDEVT3
	XBAR_CLB_MUX14_ADCBEVT4		 = 0x1C02,	//!ADCBEVT4
	XBAR_CLB_MUX14_EXTSYNCOUT		 = 0x1C03,	//!EXTSYNCOUT
	XBAR_CLB_MUX15_ADCSOCB		 = 0x1E01,	//!ADCSOCB
	XBAR_CLB_MUX15_CLB4_OUT5		 = 0x1E02,	//!CLB4 OUT5
	XBAR_CLB_MUX15_ADCDEVT4		 = 0x1E03,	//!ADCDEVT4
	XBAR_CLB_MUX16_SD1FLT1_COMPH = 0x2000,  //!SD1FLT1_COMPH
	XBAR_CLB_MUX16_SD1FLT1_COMPH_OR_COMPL = 0x2001, //SD1FLT_COMPH_OR_COMPL
	XBAR_CLB_MUX16_FSIA_RX_TRIG2		 = 0x2002,	//!FSIA RX TRIG2
	XBAR_CLB_MUX16_FSIA_RX_TRIG3		 = 0x2003,	//!FSIA RX TRIG3
	XBAR_CLB_MUX17_SD1FLT1_COMPL = 0x2200,  //!SD1FLT1_COMPL
	XBAR_CLB_MUX17_INPUTXBAR1_INPUT7		 = 0x2201,	//!INPUTXBAR INPUT7
	XBAR_CLB_MUX17_ADCEEVT1		 = 0x2202,	//!ADCEEVT1
	XBAR_CLB_MUX17_CLAHALT		 = 0x2203,	//!CLAHALT
	XBAR_CLB_MUX18_SD1FLT2_COMPH = 0x2400,  //SD1FLT2_COMPH
	XBAR_CLB_MUX18_SD1FLT2_COMPH_OR_COMPL = 0x2401,  //SD1FLT2_COMPH_OR_COMPL
	XBAR_CLB_MUX18_SD1FLT2_COMPZ = 0x2402,  //SD1FLT2_COMPZ
	XBAR_CLB_MUX18_SD1FLT2_DRINT = 0x2403,  //SD1FLT2_DRINT
	XBAR_CLB_MUX19_SD1FLT2_COMPL		 = 0x2600,	//!SD1FLT2_COMPL
	XBAR_CLB_MUX19_INPUTXBAR1_INPUT8		 = 0x2601,	//!INPUTXBAR INPUT8
	XBAR_CLB_MUX19_ADCEEVT2		 = 0x2602,	//!ADCEEVT2
	XBAR_CLB_MUX19_ERRORSTS		 = 0x2603,	//!ERRORSTS
	XBAR_CLB_MUX20_SD1FLT3_COMPH = 0x2800,  //SD1FLT3_COMPH
	XBAR_CLB_MUX20_SD1FLT3_COMPH_OR_COMPL = 0x2801,  //SD1FLT3_COMPH_OR_COMPL
	XBAR_CLB_MUX20_SD1FLT3_COMPZ = 0x2802,  //SD1FLT3_COMPZ
	XBAR_CLB_MUX20_SD1FLT3_DRINT = 0x2803,  //SD1FLT3_DRINT
	XBAR_CLB_MUX21_SD1FLT3_COMPL = 0x2A00,  //SD1FLT3_COMPL
	XBAR_CLB_MUX21_INPUTXBAR1_INPUT9		 = 0x2A01,	//!INPUTXBAR INPUT9
	XBAR_CLB_MUX21_ADCEEVT3		 = 0x2A02,	//!ADCEEVT3
	XBAR_CLB_MUX21_SD1FLT1_DRINT		 = 0x2A03,	//!SD1FLT1_DRINT
	XBAR_CLB_MUX22_SD1FLT4_COMPH = 0x2C00,  //SD1FLT4_COMPH
	XBAR_CLB_MUX22_SD1FLT4_COMPH_OR_COMPL = 0x2C01,  //SD1FLT4_COMPH_OR_COMPL
	XBAR_CLB_MUX22_SD1FLT4_COMPZ = 0x2C02,  //SD1FLT4_COMPZ
	XBAR_CLB_MUX22_SD1FLT4_DRINT = 0x2C03,  //SD1FLT4_DRINT
	XBAR_CLB_MUX23_SD1FLT4_COMPL = 0x2E00,  //SD1FLT4_COMPL
	XBAR_CLB_MUX23_INPUTXBAR1_INPUT10		 = 0x2E01,	//!INPUTXBAR INPUT10
	XBAR_CLB_MUX23_ADCEEVT4		 = 0x2E02,	//!ADCEEVT4
	XBAR_CLB_MUX24_SD2FLT1_COMPH = 0x3000,  //SD2FLT1_COMPH
	XBAR_CLB_MUX24_SD2FLT1_COMPH_OR_COMPL = 0x3001,  //SD2FLT1_COMPH_OR_COMPL
	XBAR_CLB_MUX24_CPU1_ERADEVT8		 = 0x3002,	//!CPU1 ERADEVT8
	XBAR_CLB_MUX24_SD2FLT1_DRINT = 0x3003,  //SD2FLT1_DRINT
	XBAR_CLB_MUX25_SD2FLT1_COMPL = 0x3200,  //SD2FLT1_COMPL
	XBAR_CLB_MUX25_INPUTXBAR1_INPUT11		 = 0x3201,	//!INPUTXBAR INPUT11
	XBAR_CLB_MUX25_MCANA_FEVT0		 = 0x3202,	//!MCANA FEVT0
	XBAR_CLB_MUX26_SD2FLT2_COMPH = 0x3400,  //SD2FLT2_COMPH
	XBAR_CLB_MUX26_SD2FLT2_COMPH_OR_COMPL = 0x3401,  //SD2FLT2_COMPH_OR_COMPL
	XBAR_CLB_MUX26_CPU1_ERADEVT9		 = 0x3402,	//!CPU1 ERADEVT9
	XBAR_CLB_MUX27_SD2FLT2_COMPL = 0x3600,  //SD2FLT2_COMPL
	XBAR_CLB_MUX27_INPUTXBAR1_INPUT12		 = 0x3601,	//!INPUTXBAR INPUT12
	XBAR_CLB_MUX27_MCANA_FEVT1		 = 0x3602,	//!MCANA FEVT1
	XBAR_CLB_MUX27_SD2FLT2_DRINT = 0x3603,  //SD2FLT2_DRINT
	XBAR_CLB_MUX28_SD2FLT3_COMPH = 0x3800,  //SD2FLT3_COMPH
	XBAR_CLB_MUX28_SD2FLT3_COMPH_OR_COMPL = 0x3801,  //SD2FLT3_COMPH_OR_COMPL
	XBAR_CLB_MUX28_CPU1_ERADEVT10		 = 0x3802,	//!CPU1 ERADEVT10
	XBAR_CLB_MUX29_SD2FLT3_COMPL = 0x3A00,  //SD2FLT3_COMPL
	XBAR_CLB_MUX29_INPUTXBAR1_INPUT13		 = 0x3A01,	//!INPUTXBAR INPUT13
	XBAR_CLB_MUX29_MCANA_FEVT2		 = 0x3A02,	//!MCANA FEVT2
	XBAR_CLB_MUX29_SD2FLT3_DRINT = 0x3A03,  //SD2FLT3_DRINT
	XBAR_CLB_MUX30_SD2FLT4_COMPH = 0x3C00,  //SD2FLT4_COMPH
	XBAR_CLB_MUX30_SD2FLT4_COMPH_OR_COMPL = 0x3C01,  //SD2FLT4_COMPH_OR_COMPL
	XBAR_CLB_MUX30_CPU1_ERADEVT11		 = 0x3C02,	//!CPU1 ERADEVT11
	XBAR_CLB_MUX31_SD2FLT4_COMPL = 0x3E00,  //SD2FLT4_COMPL
	XBAR_CLB_MUX31_INPUTXBAR1_INPUT14		 = 0x3E01,	//!INPUTXBAR INPUT14
	XBAR_CLB_MUX31_ERRORSTS		 = 0x3E02,	//!ERRORSTS
	XBAR_CLB_MUX31_SD2FLT4_DRINT = 0x3E03  //SD2FLT4_DRINT
} XBAR_CLBMuxConfig;



